nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxl255/driver_examples/eqdc/index_interrupt/pin_mux.c
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MCXL255xxx
package_id: MCXL255VDF
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: C10, peripheral: LPUART2, signal: TXD, pin_signal: P1_12/TRIG_IN1/LPUART2_TXD/CT_INP13/UTICK_CAP0/PWM0_B1, pull_value: low, pull_enable: disable, pull_select: down,
    invert_input: normal, input_buffer: enable, drive_strength: low, drive_strength1: normal, open_drain: disable, passive_filter: disable, slew_rate: fast}
  - {pin_num: B10, peripheral: LPUART2, signal: RXD, pin_signal: P1_13/TRIG_IN2/LPUART2_RXD/CT_INP14/UTICK_CAP1/PWM0_A1/WUU_P19, pull_value: low, pull_enable: disable,
    pull_select: down, invert_input: normal, input_buffer: enable, drive_strength: low, drive_strength1: normal, open_drain: disable, passive_filter: disable, slew_rate: fast}
  - {pin_num: A10, peripheral: INPUTMUX0, signal: 'TRIG_IN, 3', pin_signal: P1_14/TRIG_IN3/LPUART2_CTS_B/LPSPI0_PCS2/CT2_MAT0/UTICK_CAP2/LPTMR0_ALT2/WUU_P24, pull_value: low,
    pull_enable: disable, pull_select: down, invert_input: normal, input_buffer: enable, drive_strength: low, drive_strength1: normal, open_drain: disable, passive_filter: disable,
    slew_rate: fast}
  - {pin_num: N6, peripheral: INPUTMUX0, signal: 'TRIG_IN, 6', pin_signal: P0_26/TRIG_IN6/LPSPI1_PCS3/UTICK_CAP2/CMP0_OUT/CT_INP8/CT1_MAT0, pull_value: low, pull_enable: disable,
    pull_select: down, invert_input: normal, input_buffer: enable, drive_strength: low, drive_strength1: normal, open_drain: disable, passive_filter: disable, slew_rate: fast}
  - {pin_num: B1, peripheral: INPUTMUX0, signal: 'TRIG_IN, 0', pin_signal: P0_2/TRIG_IN0/LPUART1_RTS_B/LPI2C0_SDAS/CT1_MAT2/PWM0_B0/CMP0_OUT/ADC0_A13, pull_value: low,
    pull_enable: disable, pull_select: down, invert_input: normal, input_buffer: enable, drive_strength: low, drive_strength1: normal, open_drain: disable, passive_filter: disable,
    slew_rate: fast}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Write to PORT0: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT0);
    /* Write to PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* INPUTMUX0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /* PORT0 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT0_RST_SHIFT_RSTn);
    /* LPUART2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART2_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);

    const port_pin_config_t port0_26_pinN6_config = {/* Internal pull-up/down resistor is disabled */
                                                     kPORT_PullDisable,
                                                     /* Low internal pull resistor value is selected. */
                                                     kPORT_LowPullResistor,
                                                     /* Fast slew rate is configured */
                                                     kPORT_FastSlewRate,
                                                     /* Passive input filter is disabled */
                                                     kPORT_PassiveFilterDisable,
                                                     /* Open drain output is disabled */
                                                     kPORT_OpenDrainDisable,
                                                     /* Low drive strength is configured */
                                                     kPORT_LowDriveStrength,
                                                     /* Normal drive strength is configured */
                                                     kPORT_NormalDriveStrength,
                                                     /* Pin is configured as TRIG_IN6 */
                                                     kPORT_MuxAlt1,
                                                     /* Digital input enabled */
                                                     kPORT_InputBufferEnable,
                                                     /* Digital input is not inverted */
                                                     kPORT_InputNormal,
                                                     /* Pin Control Register fields [15:0] are not locked */
                                                     kPORT_UnlockRegister};
    /* PORT0_26 (pin N6) is configured as TRIG_IN6 */
    PORT_SetPinConfig(PORT0, 26U, &port0_26_pinN6_config);

    const port_pin_config_t port1_12_pinC10_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      kPORT_NormalDriveStrength,
                                                      /* Pin is configured as LPUART2_TXD */
                                                      kPORT_MuxAlt2,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT1_12 (pin C10) is configured as LPUART2_TXD */
    PORT_SetPinConfig(PORT1, 12U, &port1_12_pinC10_config);

    const port_pin_config_t port1_13_pinB10_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      kPORT_NormalDriveStrength,
                                                      /* Pin is configured as LPUART2_RXD */
                                                      kPORT_MuxAlt2,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT1_13 (pin B10) is configured as LPUART2_RXD */
    PORT_SetPinConfig(PORT1, 13U, &port1_13_pinB10_config);

    const port_pin_config_t port1_14_pinA10_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Normal drive strength is configured */
                                                      kPORT_NormalDriveStrength,
                                                      /* Pin is configured as TRIG_IN3 */
                                                      kPORT_MuxAlt1,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT1_14 (pin A10) is configured as TRIG_IN3 */
    PORT_SetPinConfig(PORT1, 14U, &port1_14_pinA10_config);

    const port_pin_config_t port0_2_pinB1_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    kPORT_NormalDriveStrength,
                                                    /* Pin is configured as TRIG_IN0 */
                                                    kPORT_MuxAlt1,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT0_2 (pin B1) is configured as TRIG_IN0 */
    PORT_SetPinConfig(PORT0, 2U, &port0_2_pinB1_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
